# TextFont

## Description
Procedure TextFont sets the active font for the document.

```pascal
PROCEDURE TextFont(fontID : INTEGER);
```

```python

def vs.TextFont(fontID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fontID|INTEGER|Font ID setting for document.|

## Examples
```pascal
TextFont(GetFontID('Times'));
```

## Version
Availability: from MiniCAD
## Category
* Objects - Text